app/views/users/_form.html.erb

    <%= f.label :department_id %><br>
    <%= f.select :department_id, options_for_select(Department.all.map { |d| [d.name,d.id] }, @user.department_id) %>
---
SELECT "departments".* FROM "departments"