app/views/tickets/_form.html.erb

    <%= f.label :customer_id %><br>
    <%= f.select :customer_id, options_for_select(User.all.map {|u| [u.name,u.id]},:customer_id) %>
---
SELECT "users".* FROM "users"

    <%= f.label :department_id %><br>
    <%= f.select :department_id, options_for_select(Department.all.map {|d| [u.name,u.id]},:department_id) %>
---
SELECT "departments".* FROM "departments"