app/controllers/tickets_controller.rb

SELECT "tickets".* FROM "tickets"
---
  def index
    @tickets = Ticket.all

INSERT INTO "tickets" ("title", "description", "customer_id", "assignee_id", "department_id", "status", "las_answer_at", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @ticket = Ticket.new(ticket_params)

    respond_to do |format|
      if @ticket.save

SELECT  "tickets".* FROM "tickets" WHERE "tickets"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_ticket
      @ticket = Ticket.find(params[:id])