app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "email", "department_id", "date_income", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "department_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["department_id", 1], ["updated_at", "2015-06-06 19:26:19.324597"], ["id", 1]]